services/auth/artillery/update-refresh-token.yaml
config:
  target: 'https://1lwqsdgvjj.execute-api.eu-west-1.amazonaws.com/dev/api/v1'
  phases:
    - duration: 60
      arrivalRate: 100
      rampTo: 100
scenarios:
  - flow:
    - post:
        url: "/auth/save-refresh-token"
        json:
          refreshToken: "CognitoIdentityServiceProvider.591ks4ote088d4mr5qm31m5m5q.346d3955-c8b0-4090-b2a6-9273f32de02b.refreshToken:eyJjdHkiOiJKV1QiLCJlbmMiOiJBMjU2R0NNIiwiYWxnIjoiUlNBLU9BRVAifQ.av-z7MJ87niRaNYLPiRWfDzYZHFiCvGSx04KhYjBtWOKIozSHUctmrw22yWl6K-NbqU8ZXp7uPPabR2XxSszt5qpPlQrQPMtoSawRYZlh3aF6E4vomoT2xe6FklAqwGgy373UFETVD3OIV0OLPcwKTkrV9G2dL6vxmksxdnkdX0hlO1pn-GvuvKWDO4fPen0Dju4evL5OVAn43bI7xLwgvuzyKrh7GvMOW1-7RimMyocNRwcG2-3_ZmjE5aWMIG1jALkjIWtjBO-xDFCEcqPLDxy6C-NDoyrwwgWw9BOCIcACIDOIh6KFcECC-JUZk2w8CxHzFAZs7tAR5qZ9DmJ3w.AldoRkzvhnhsOgyf.L7Jt4FEAYhsfMpFTNP1JVN7ReHdHz2nob2whUV1aYQrip0ZAtckeSUm4qmVVP6mblEfkvy3v1WWshN9s8tbOPrEnalWzSg1saR0qHehJ7zU-1ZC2u3ydJvoa7Og41OSriUB3IyWnXkzUeADY4td4U81tPcmCWZ2dGbLcrXOurdebT7PY84f5qK_qcqqDua0rmS4o9M_qDazPjOjJyzu_K1dObukSGMTA8rEYb4cDm_alWnioRatbIDWme6or6olwnBcnpo-w4UhvRY-uyI3Ahw1I0mIN8eawQQHQ-SgGiIk_jW1hI9BPAmMl42MMRR8JWIO2V9DUrFnud22iVZGiyPh4pAJvmb5OHIzIp0ap8oUl8md6ms14QKP_dBhi3jRS04Ec3uPnmCDJgmq3nNG3kwsh8vusholH3Er9pqBWei-fDR_ERV754qhY5-IUVz5Bd7uMRhdfK15EeXfmfTqlUdGv43LNcfjqgc8zhx7vGi86QPjOeGbjOavyOhGekS9HRPklcqpQaeVe6wirxXuhcUcTyp9zQXaMcMs6HPwLaX2jd8P4yEf0SDnHP-sVKY18aOhhdg42EKGWepcaKYZxboBC6i7vs3ko2NuEyJlwxysjSebqpIYKWe1Ozirw444GZrakuVaqnxGd3OyVlgfHqsKbfgIZfCGFFL51zyebAgefxJeHifokn1VW1y5s_kmmPB_MOgOOVuOkNIHFXnKpQVeZXKpMmXjJgaMuWOfKB0Y5fzKArkM6in77TVoputwF9cgHbMf_-MOcwUkSsLVBYMaPLignMIps01c1NMVSShurKvtbeKdpQUXZ43lpbLVrLDWFHOEFJTLgTscE-1BYjCf04FSAc7fxaci8QFHzB0B5S26I_AW2QJba94XlB1L6SiBekQY9XJ3GdzY_0JZ5yJcHp64PnUgiOiW6yB46iIo1GHrN9UL-TpBNUQ1_KZ4Vxp7Dfatj6pma9mruLHpPXXfWlx_OLSINUWhzRFxB7gaPnEJxW_Z8Ta6Tn_LANBX61ZQ-j9soCpFQR8yrMlfAPa5yLQsvIHNj9fPYzUA4tTyBHvAbfleXDW50mbQJ0pwq1951nhWYdRGFgHBs9KhcRVaYc-dxwGh2qTaHoSaiywmEXO6POfLsmBQWzUHKHFlpblMh9CRjif-PeYOiwji1DTGkT1oW9mbV5Rr1Pddw2F8Bd2s9TDiyOzxHhSMkPbhifV2NCNVQwoUmkoOZZZzljbUrMWl21OMk6-UWHodMHx2YsnjsQPUGXWUalrmjB3QfDLtUi8YMWFuVfYWdJ50JkD6qCxvFT1BKwFOclRzGLmfNAwXj89MVrEuV7A.DLA4AsunKMwKVRwrRZ03rQ"
        headers:
          Authorization: "eyJraWQiOiJTeFdsYldKOHh6N0V5UjBES3J1N1dmRUx4Q1BHejlJWlZEWVwvb1hjZ0F1VT0iLCJhbGciOiJSUzI1NiJ9.eyJzdWIiOiIzNDZkMzk1NS1jOGIwLTQwOTAtYjJhNi05MjczZjMyZGUwMmIiLCJjdXN0b206YWxpYXMiOiJkZXYiLCJlbWFpbF92ZXJpZmllZCI6dHJ1ZSwiaXNzIjoiaHR0cHM6XC9cL2NvZ25pdG8taWRwLmV1LXdlc3QtMS5hbWF6b25hd3MuY29tXC9ldS13ZXN0LTFfNFFRbmwyQWdUIiwicGhvbmVfbnVtYmVyX3ZlcmlmaWVkIjp0cnVlLCJjb2duaXRvOnVzZXJuYW1lIjoiMzQ2ZDM5NTUtYzhiMC00MDkwLWIyYTYtOTI3M2YzMmRlMDJiIiwiZ2l2ZW5fbmFtZSI6IlRlc3QiLCJteVBheVVzZXJJZCI6IjE3MyIsImF1ZCI6IjU5MWtzNG90ZTA4OGQ0bXI1cW0zMW01bTVxIiwiZXZlbnRfaWQiOiIwODFhZGViMC03Yzk0LTRlMjQtOWM3Mi1mYjI0OTFiYzc0ZmMiLCJ0b2tlbl91c2UiOiJpZCIsImF1dGhfdGltZSI6MTYwNTU0ODc0NywiaG9zdCI6Ind3dy5kdW1teS1nZnNhc2Qud2ViLmNvbSIsInBob25lX251bWJlciI6IiszNzM2OTk2NDI2MiIsIm1lcmNoYW50cyI6IlsyNjAsMjYxLDI2MiwzODBdIiwiZXhwIjoxNjA1NTUyMzQ3LCJjdXN0b206cmVzZWxsZXJVcmwiOiJwb3J0YWwuZGF0bWFuY3JtLmNvbSIsImlhdCI6MTYwNTU0ODc0NywiZmFtaWx5X25hbWUiOiJUZXN0IiwiZW1haWwiOiJteXBheS5vYXV0aCtkZXYwMDBAZ21haWwuY29tIn0.CvwtiXm0cIvTjNsUHG0WIn5pLZXzr_Hf-EXH-d9lv5iLbcs2NmmsX4WroLGJDnKO0stoDRlJZukjnJeR3SSWn8L35yPZXljZxuqkMOtBP2NW46zjENyjcJCpew8RJugvXTGWtFmcVlENh91u9M3YlSQqOukqT0C02fz0X5B2peIVb2TdXfBDMuEonnP3Q0eBRnBh3xnemTAAKjFv7HZw3_0ctFB_oLjq3_4_DSIMmxqVCRuvRX9bzGT3IzfFKq-E3gQ2bw4cYBmNIFb88rj_myn-4m62ePpn6vnDzmwum5hKX9pbA8S1Bs8Ff-uy93g-yZyIDbbkjjAI_vg1gg46iQ"